Revit 2027 API
ContinuousRailType.Transition Property
 The transition option of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RailTransitionOption Transition { get; set; }
Public Property Transition As RailTransitionOption
	Get
	Set
public:
property RailTransitionOption Transition {
	RailTransitionOption get ();
	void set (RailTransitionOption value);
}
member Transition : RailTransitionOption with get, set
Property Value
RailTransitionOption
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace